---
title: NumericRevisionSettings
classe: Autodesk.Revit.DB.NumericRevisionSettings
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# NumericRevisionSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `numericRevisionSettings.IsValidObject` | Boolean |
| `Int32 MinimumDigits { get; set; }` | `numericRevisionSettings.MinimumDigits` | Int32 |
| `String Prefix { get; set; }` | `numericRevisionSettings.Prefix` | String |
| `Int32 StartNumber { get; set; }` | `numericRevisionSettings.StartNumber` | Int32 |
| `String Suffix { get; set; }` | `numericRevisionSettings.Suffix` | String |
| `Void Dispose()` | `numericRevisionSettings.Dispose()` | Void |
| `Boolean IsEqual(NumericRevisionSettings)` | `numericRevisionSettings.IsEqual(other)` | Boolean |
| `Boolean IsValid()` | `numericRevisionSettings.IsValid()` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```